# PointElementNormalizedCurveParamater Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointElementNormalizedCurveParamater Property
ParameterTypeId Class See Also
---
"Normalized Curve Parameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointElementNormalizedCurveParamater { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointElementNormalizedCurveParamater As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointElementNormalizedCurveParamater {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace